PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1614.inc
;----- PID1K1L Bits -----------------------------------------------------
PID1K10          EQU  H'0000'
PID1K11          EQU  H'0001'
PID1K12          EQU  H'0002'
PID1K13          EQU  H'0003'
PID1K14          EQU  H'0004'
PID1K15          EQU  H'0005'
PID1K16          EQU  H'0006'
PID1K17          EQU  H'0007'

K10              EQU  H'0000'
K11              EQU  H'0001'
K12              EQU  H'0002'
K13              EQU  H'0003'
K14              EQU  H'0004'
K15              EQU  H'0005'
K16              EQU  H'0006'
K17              EQU  H'0007'


;----- PID1K1H Bits -----------------------------------------------------
PID1K18          EQU  H'0000'
PID1K19          EQU  H'0001'
PID1K110         EQU  H'0002'
PID1K111         EQU  H'0003'
PID1K112         EQU  H'0004'
PID1K113         EQU  H'0005'
PID1K114         EQU  H'0006'
PID1K115         EQU  H'0007'

K18              EQU  H'0000'
K19              EQU  H'0001'
K110             EQU  H'0002'
K111             EQU  H'0003'
K112             EQU  H'0004'
K113             EQU  H'0005'
K114             EQU  H'0006'
K115             EQU  H'0007'


;----- PID1K2L Bits -----------------------------------------------------
PID1K20          EQU  H'0000'
PID1K21          EQU  H'0001'
PID1K22          EQU  H'0002'
PID1K23          EQU  H'0003'
PID1K24          EQU  H'0004'
PID1K25          EQU  H'0005'
PID1K26          EQU  H'0006'
PID1K27          EQU  H'0007'

K20              EQU  H'0000'
K21              EQU  H'0001'
K22              EQU  H'0002'
K23              EQU  H'0003'
K24              EQU  H'0004'
K25              EQU  H'0005'
K26              EQU  H'0006'
K27              EQU  H'0007'


;----- PID1K2H Bits -----------------------------------------------------
PID1K28          EQU  H'0000'
PID1K29          EQU  H'0001'
PID1K210         EQU  H'0002'
PID1K211         EQU  H'0003'
PID1K212         EQU  H'0004'
PID1K213         EQU  H'0005'
PID1K214         EQU  H'0006'
PID1K215         EQU  H'0007'

K28              EQU  H'0000'
K29              EQU  H'0001'
K210             EQU  H'0002'
K211             EQU  H'0003'
K212             EQU  H'0004'
K213             EQU  H'0005'
K214             EQU  H'0006'
K215             EQU  H'0007'


;----- PID1K3L Bits -----------------------------------------------------
PID1K30          EQU  H'0000'
PID1K31          EQU  H'0001'
PID1K32          EQU  H'0002'
PID1K33          EQU  H'0003'
PID1K34          EQU  H'0004'
PID1K35          EQU  H'0005'
PID1K36          EQU  H'0006'
PID1K37          EQU  H'0007'

K30              EQU  H'0000'
K31              EQU  H'0001'
K32              EQU  H'0002'
K33              EQU  H'0003'
K34              EQU  H'0004'
K35              EQU  H'0005'
K36              EQU  H'0006'
K37              EQU  H'0007'


;----- PID1K3H Bits -----------------------------------------------------
PID1K38          EQU  H'0000'
PID1K39          EQU  H'0001'
PID1K310         EQU  H'0002'
PID1K311         EQU  H'0003'
PID1K312         EQU  H'0004'
PID1K313         EQU  H'0005'
PID1K314         EQU  H'0006'
PID1K315         EQU  H'0007'

K38              EQU  H'0000'
K39              EQU  H'0001'
K310             EQU  H'0002'
K311             EQU  H'0003'
K312             EQU  H'0004'
K313             EQU  H'0005'
K314             EQU  H'0006'
K315             EQU  H'0007'


;----- PID1OUTLL Bits -----------------------------------------------------
PID1OUT0         EQU  H'0000'
PID1OUT1         EQU  H'0001'
PID1OUT2         EQU  H'0002'
PID1OUT3         EQU  H'0003'
PID1OUT4         EQU  H'0004'
PID1OUT5         EQU  H'0005'
PID1OUT6         EQU  H'0006'
PID1OUT7         EQU  H'0007'

OUT0             EQU  H'0000'
OUT1             EQU  H'0001'
OUT2             EQU  H'0002'
OUT3             EQU  H'0003'
OUT4             EQU  H'0004'
OUT5             EQU  H'0005'
OUT6             EQU  H'0006'
OUT7             EQU  H'0007'


;----- PID1OUTLH Bits -----------------------------------------------------
PID1OUT8         EQU  H'0000'
PID1OUT9         EQU  H'0001'
PID1OUT10        EQU  H'0002'
PID1OUT11        EQU  H'0003'
PID1OUT12        EQU  H'0004'
PID1OUT13        EQU  H'0005'
PID1OUT14        EQU  H'0006'
PID1OUT15        EQU  H'0007'

OUT8             EQU  H'0000'
OUT9             EQU  H'0001'
OUT10            EQU  H'0002'
OUT11            EQU  H'0003'
OUT12            EQU  H'0004'
OUT13            EQU  H'0005'
OUT14            EQU  H'0006'
OUT15            EQU  H'0007'


;----- PID1OUTHL Bits -----------------------------------------------------
PID1OUT16        EQU  H'0000'
PID1OUT17        EQU  H'0001'
PID1OUT18        EQU  H'0002'
PID1OUT19        EQU  H'0003'
PID1OUT20        EQU  H'0004'
PID1OUT21        EQU  H'0005'
PID1OUT22        EQU  H'0006'
PID1OUT23        EQU  H'0007'

OUT16            EQU  H'0000'
OUT17            EQU  H'0001'
OUT18            EQU  H'0002'
OUT19            EQU  H'0003'
OUT20            EQU  H'0004'
OUT21            EQU  H'0005'
OUT22            EQU  H'0006'
OUT23            EQU  H'0007'


;----- PID1OUTHH Bits -----------------------------------------------------
PID1OUT24        EQU  H'0000'
PID1OUT25        EQU  H'0001'
PID1OUT26        EQU  H'0002'
PID1OUT27        EQU  H'0003'
PID1OUT28        EQU  H'0004'
PID1OUT29        EQU  H'0005'
PID1OUT30        EQU  H'0006'
PID1OUT31        EQU  H'0007'

OUT24            EQU  H'0000'
OUT25            EQU  H'0001'
OUT26            EQU  H'0002'
OUT27            EQU  H'0003'
OUT28            EQU  H'0004'
OUT29            EQU  H'0005'
OUT30            EQU  H'0006'
OUT31            EQU  H'0007'


;----- PID1OUTU Bits -----------------------------------------------------
PID1OUT32        EQU  H'0000'
PID1OUT33        EQU  H'0001'
PID1OUT34        EQU  H'0002'
PID1OUT35        EQU  H'0003'

OUT32            EQU  H'0000'
OUT33            EQU  H'0001'
OUT34            EQU  H'0002'
OUT35            EQU  H'0003'


;----- PID1Z1L Bits -----------------------------------------------------
PID1Z10          EQU  H'0000'
PID1Z11          EQU  H'0001'
PID1Z12          EQU  H'0002'
PID1Z13          EQU  H'0003'
PID1Z14          EQU  H'0004'
PID1Z15          EQU  H'0005'
PID1Z16          EQU  H'0006'
PID1Z17          EQU  H'0007'

Z10              EQU  H'0000'
Z11              EQU  H'0001'
Z12              EQU  H'0002'
Z13              EQU  H'0003'
Z14              EQU  H'0004'
Z15              EQU  H'0005'
Z16              EQU  H'0006'
Z17              EQU  H'0007'


;----- PID1Z1H Bits -----------------------------------------------------
PID1Z18          EQU  H'0000'
PID1Z19          EQU  H'0001'
PID1Z110         EQU  H'0002'
PID1Z111         EQU  H'0003'
PID1Z112         EQU  H'0004'
PID1Z113         EQU  H'0005'
PID1Z114         EQU  H'0006'
PID1Z115         EQU  H'0007'

Z18              EQU  H'0000'
Z19              EQU  H'0001'
Z110             EQU  H'0002'
Z111             EQU  H'0003'
Z112             EQU  H'0004'
Z113             EQU  H'0005'
Z114             EQU  H'0006'
Z115             EQU  H'0007'


;----- PID1Z1U Bits -----------------------------------------------------
PID1Z116         EQU  H'0000'

Z116             EQU  H'0000'


;----- PID1Z2L Bits -----------------------------------------------------
PID1Z20          EQU  H'0000'
PID1Z21          EQU  H'0001'
PID1Z22          EQU  H'0002'
PID1Z23          EQU  H'0003'
PID1Z24          EQU  H'0004'
PID1Z25          EQU  H'0005'
PID1Z26          EQU  H'0006'
PID1Z27          EQU  H'0007'

Z20              EQU  H'0000'
Z21              EQU  H'0001'
Z22              EQU  H'0002'
Z23              EQU  H'0003'
Z24              EQU  H'0004'
Z25              EQU  H'0005'
Z26              EQU  H'0006'
Z27              EQU  H'0007'


