PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1614.inc
;----- PID1Z2H Bits -----------------------------------------------------
PID1Z28          EQU  H'0000'
PID1Z29          EQU  H'0001'
PID1Z210         EQU  H'0002'
PID1Z211         EQU  H'0003'
PID1Z212         EQU  H'0004'
PID1Z213         EQU  H'0005'
PID1Z214         EQU  H'0006'
PID1Z215         EQU  H'0007'

Z28              EQU  H'0000'
Z29              EQU  H'0001'
Z210             EQU  H'0002'
Z211             EQU  H'0003'
Z212             EQU  H'0004'
Z213             EQU  H'0005'
Z214             EQU  H'0006'
Z215             EQU  H'0007'


;----- PID1Z2U Bits -----------------------------------------------------
PID1Z216         EQU  H'0000'

Z216             EQU  H'0000'


;----- PID1ACCLL Bits -----------------------------------------------------
PID1ACC0         EQU  H'0000'
PID1ACC1         EQU  H'0001'
PID1ACC2         EQU  H'0002'
PID1ACC3         EQU  H'0003'
PID1ACC4         EQU  H'0004'
PID1ACC5         EQU  H'0005'
PID1ACC6         EQU  H'0006'
PID1ACC7         EQU  H'0007'

ACC0             EQU  H'0000'
ACC1             EQU  H'0001'
ACC2             EQU  H'0002'
ACC3             EQU  H'0003'
ACC4             EQU  H'0004'
ACC5             EQU  H'0005'
ACC6             EQU  H'0006'
ACC7             EQU  H'0007'


;----- PID1ACCLH Bits -----------------------------------------------------
PID1ACC8         EQU  H'0000'
PID1ACC9         EQU  H'0001'
PID1ACC10        EQU  H'0002'
PID1ACC11        EQU  H'0003'
PID1ACC12        EQU  H'0004'
PID1ACC13        EQU  H'0005'
PID1ACC14        EQU  H'0006'
PID1ACC15        EQU  H'0007'

ACC8             EQU  H'0000'
ACC9             EQU  H'0001'
ACC10            EQU  H'0002'
ACC11            EQU  H'0003'
ACC12            EQU  H'0004'
ACC13            EQU  H'0005'
ACC14            EQU  H'0006'
ACC15            EQU  H'0007'


;----- PID1ACCHL Bits -----------------------------------------------------
PID1ACC16        EQU  H'0000'
PID1ACC17        EQU  H'0001'
PID1ACC18        EQU  H'0002'
PID1ACC19        EQU  H'0003'
PID1ACC20        EQU  H'0004'
PID1ACC21        EQU  H'0005'
PID1ACC22        EQU  H'0006'
PID1ACC23        EQU  H'0007'

ACC16            EQU  H'0000'
ACC17            EQU  H'0001'
ACC18            EQU  H'0002'
ACC19            EQU  H'0003'
ACC20            EQU  H'0004'
ACC21            EQU  H'0005'
ACC22            EQU  H'0006'
ACC23            EQU  H'0007'


;----- PID1ACCHH Bits -----------------------------------------------------
PID1ACC24        EQU  H'0000'
PID1ACC25        EQU  H'0001'
PID1ACC26        EQU  H'0002'
PID1ACC27        EQU  H'0003'
PID1ACC28        EQU  H'0004'
PID1ACC29        EQU  H'0005'
PID1ACC30        EQU  H'0006'
PID1ACC31        EQU  H'0007'

ACC24            EQU  H'0000'
ACC25            EQU  H'0001'
ACC26            EQU  H'0002'
ACC27            EQU  H'0003'
ACC28            EQU  H'0004'
ACC29            EQU  H'0005'
ACC30            EQU  H'0006'
ACC31            EQU  H'0007'


;----- PID1ACCU Bits -----------------------------------------------------
PID1ACC32        EQU  H'0000'
PID1ACC33        EQU  H'0001'
PID1ACC34        EQU  H'0002'

ACC32            EQU  H'0000'
ACC33            EQU  H'0001'
ACC34            EQU  H'0002'


;----- PID1CON Bits -----------------------------------------------------
PID1BUSY         EQU  H'0006'
PID1EN           EQU  H'0007'

BUSY_PID1CON     EQU  H'0006'
EN               EQU  H'0007'

MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'

PID1MODE0        EQU  H'0000'
PID1MODE1        EQU  H'0001'
PID1MODE2        EQU  H'0002'


;----- PWM3DCL Bits -----------------------------------------------------
DC0              EQU  H'0006'
DC1              EQU  H'0007'

PWM3DC0          EQU  H'0006'
PWM3DC1          EQU  H'0007'

PWMPW0           EQU  H'0006'
PWMPW1           EQU  H'0007'


;----- PWM3DCH Bits -----------------------------------------------------
DC2              EQU  H'0000'
DC3              EQU  H'0001'
DC4              EQU  H'0002'
DC5              EQU  H'0003'
DC6              EQU  H'0004'
DC7              EQU  H'0005'
DC8              EQU  H'0006'
DC9              EQU  H'0007'

PWM3DC2          EQU  H'0000'
PWM3DC3          EQU  H'0001'
PWM3DC4          EQU  H'0002'
PWM3DC5          EQU  H'0003'
PWM3DC6          EQU  H'0004'
PWM3DC7          EQU  H'0005'
PWM3DC8          EQU  H'0006'
PWM3DC9          EQU  H'0007'

PWMPW2           EQU  H'0000'
PWMPW3           EQU  H'0001'
PWMPW4           EQU  H'0002'
PWMPW5           EQU  H'0003'
PWMPW6           EQU  H'0004'
PWMPW7           EQU  H'0005'
PWMPW8           EQU  H'0006'
PWMPW9           EQU  H'0007'


;----- PWM3CON Bits -----------------------------------------------------
POL_PWM3CON      EQU  H'0004'
OUT              EQU  H'0005'
EN               EQU  H'0007'

PWM3POL          EQU  H'0004'
PWM3OUT          EQU  H'0005'
PWM3EN           EQU  H'0007'


;----- PWM4DCL Bits -----------------------------------------------------
DC0              EQU  H'0006'
DC1              EQU  H'0007'

PWM4DC0          EQU  H'0006'
PWM4DC1          EQU  H'0007'

PWMPW0           EQU  H'0006'
PWMPW1           EQU  H'0007'


;----- PWM4DCH Bits -----------------------------------------------------
DC2              EQU  H'0000'
DC3              EQU  H'0001'
DC4              EQU  H'0002'
DC5              EQU  H'0003'
DC6              EQU  H'0004'
DC7              EQU  H'0005'
DC8              EQU  H'0006'
DC9              EQU  H'0007'

PWM4DC2          EQU  H'0000'
PWM4DC3          EQU  H'0001'
PWM4DC4          EQU  H'0002'
PWM4DC5          EQU  H'0003'
PWM4DC6          EQU  H'0004'
PWM4DC7          EQU  H'0005'
PWM4DC8          EQU  H'0006'
PWM4DC9          EQU  H'0007'

PWMPW2           EQU  H'0000'
PWMPW3           EQU  H'0001'
PWMPW4           EQU  H'0002'
PWMPW5           EQU  H'0003'
PWMPW6           EQU  H'0004'
PWMPW7           EQU  H'0005'
PWMPW8           EQU  H'0006'
PWMPW9           EQU  H'0007'


;----- PWM4CON Bits -----------------------------------------------------
POL_PWM4CON      EQU  H'0004'
OUT              EQU  H'0005'
EN               EQU  H'0007'

PWM4POL          EQU  H'0004'
PWM4OUT          EQU  H'0005'
PWM4EN           EQU  H'0007'


;----- CWG1DBR Bits -----------------------------------------------------
DBR0             EQU  H'0000'
DBR1             EQU  H'0001'
DBR2             EQU  H'0002'
DBR3             EQU  H'0003'
DBR4             EQU  H'0004'
DBR5             EQU  H'0005'


CWG1DBR0         EQU  H'0000'
CWG1DBR1         EQU  H'0001'
CWG1DBR2         EQU  H'0002'
CWG1DBR3         EQU  H'0003'
CWG1DBR4         EQU  H'0004'
CWG1DBR5         EQU  H'0005'


