PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1614.inc
AT1CS            EQU  H'0000'

CS0              EQU  H'0000'

AT1CS0           EQU  H'0000'


;----- AT1SIG Bits -----------------------------------------------------
AT1SSEL0         EQU  H'0000'
AT1SSEL1         EQU  H'0001'
AT1SSEL2         EQU  H'0002'

SSEL0            EQU  H'0000'
SSEL1            EQU  H'0001'
SSEL2            EQU  H'0002'



;----- AT1CSEL1 Bits -----------------------------------------------------
AT1CP1S0         EQU  H'0000'
AT1CP1S1         EQU  H'0001'
AT1CP1S2         EQU  H'0002'

CP1S0            EQU  H'0000'
CP1S1            EQU  H'0001'
CP1S2            EQU  H'0002'



;----- AT1CC1L Bits -----------------------------------------------------
AT1CC10          EQU  H'0000'
AT1CC11          EQU  H'0001'
AT1CC12          EQU  H'0002'
AT1CC13          EQU  H'0003'
AT1CC14          EQU  H'0004'
AT1CC15          EQU  H'0005'
AT1CC16          EQU  H'0006'
AT1CC17          EQU  H'0007'

CC10             EQU  H'0000'
CC11             EQU  H'0001'
CC12             EQU  H'0002'
CC13             EQU  H'0003'
CC14             EQU  H'0004'
CC15             EQU  H'0005'
CC16             EQU  H'0006'
CC17             EQU  H'0007'


;----- AT1CC1H Bits -----------------------------------------------------
AT1CC18          EQU  H'0000'
AT1CC19          EQU  H'0001'

CC18             EQU  H'0000'
CC19             EQU  H'0001'


;----- AT1CCON1 Bits -----------------------------------------------------
AT1CC1MODE       EQU  H'0000'
AT1CAP1P         EQU  H'0003'
AT1CC1POL        EQU  H'0004'
AT1CC1EN         EQU  H'0007'

CC1MODE          EQU  H'0000'
CAP1P            EQU  H'0003'
CC1POL           EQU  H'0004'
CC1EN            EQU  H'0007'


;----- AT1CSEL2 Bits -----------------------------------------------------
AT1CP2S0         EQU  H'0000'
AT1CP2S1         EQU  H'0001'
AT1CP2S2         EQU  H'0002'


CP2S0            EQU  H'0000'
CP2S1            EQU  H'0001'
CP2S2            EQU  H'0002'


;----- AT1CC2L Bits -----------------------------------------------------
AT1CC20          EQU  H'0000'
AT1CC21          EQU  H'0001'
AT1CC22          EQU  H'0002'
AT1CC23          EQU  H'0003'
AT1CC24          EQU  H'0004'
AT1CC25          EQU  H'0005'
AT1CC26          EQU  H'0006'
AT1CC27          EQU  H'0007'

CC20             EQU  H'0000'
CC21             EQU  H'0001'
CC22             EQU  H'0002'
CC13             EQU  H'0003'
CC24             EQU  H'0004'
CCW5             EQU  H'0005'
CC26             EQU  H'0006'
CC27             EQU  H'0007'


;----- AT1CC2H Bits -----------------------------------------------------
AT1CC28          EQU  H'0000'
AT1CC29          EQU  H'0001'

CC28             EQU  H'0000'
CC29             EQU  H'0001'


;----- AT1CCON2 Bits -----------------------------------------------------
AT1CC2MODE       EQU  H'0000'
AT1CAP2P         EQU  H'0003'
AT1CC2POL        EQU  H'0004'
AT1CC2EN         EQU  H'0007'

CC2MODE          EQU  H'0000'
CAP2P            EQU  H'0003'
CC2POL           EQU  H'0004'
CC2EN            EQU  H'0007'


;----- AT1CSEL3 Bits -----------------------------------------------------
AT1CP3S0         EQU  H'0000'
AT1CP3S1         EQU  H'0001'
AT1CP3S2         EQU  H'0002'


CP3S0            EQU  H'0000'
CP3S1            EQU  H'0001'
CP3S2            EQU  H'0002'


;----- AT1CC3L Bits -----------------------------------------------------
AT1CC30          EQU  H'0000'
AT1CC31          EQU  H'0001'
AT1CC32          EQU  H'0002'
AT1CC33          EQU  H'0003'
AT1CC34          EQU  H'0004'
AT1CC35          EQU  H'0005'
AT1CC36          EQU  H'0006'
AT1CC37          EQU  H'0007'

CC30             EQU  H'0000'
CC31             EQU  H'0001'
CC32             EQU  H'0002'
CC33             EQU  H'0003'
CC34             EQU  H'0004'
CC35             EQU  H'0005'
CC36             EQU  H'0006'
CC37             EQU  H'0007'


;----- AT1CC3H Bits -----------------------------------------------------
AT1CC38          EQU  H'0000'
AT1CC39          EQU  H'0001'

CC38             EQU  H'0000'
CC39             EQU  H'0001'


;----- AT1CCON3 Bits -----------------------------------------------------
AT1CC3MODE       EQU  H'0000'
AT1CAP3P         EQU  H'0003'
AT1CC3POL        EQU  H'0004'
AT1CC3EN         EQU  H'0007'

CC3MODE          EQU  H'0000'
CAP3P            EQU  H'0003'
CC3POL           EQU  H'0004'
CC3EN            EQU  H'0007'


;----- SMT1TMRL Bits -----------------------------------------------------
SMT1TMR0         EQU  H'0000'
SMT1TMR1         EQU  H'0001'
SMT1TMR2         EQU  H'0002'
SMT1TMR3         EQU  H'0003'
SMT1TMR4         EQU  H'0004'
SMT1TMR5         EQU  H'0005'
SMT1TMR6         EQU  H'0006'
SMT1TMR7         EQU  H'0007'


;----- SMT1TMRH Bits -----------------------------------------------------
SMT1TMR8         EQU  H'0000'
SMT1TMR9         EQU  H'0001'
SMT1TMR10        EQU  H'0002'
SMT1TMR11        EQU  H'0003'
SMT1TMR12        EQU  H'0004'
SMT1TMR13        EQU  H'0005'
SMT1TMR14        EQU  H'0006'
SMT1TMR15        EQU  H'0007'


;----- SMT1TMRU Bits -----------------------------------------------------
SMT1TMR16        EQU  H'0000'
SMT1TMR17        EQU  H'0001'
SMT1TMR18        EQU  H'0002'
SMT1TMR19        EQU  H'0003'
SMT1TMR20        EQU  H'0004'
SMT1TMR21        EQU  H'0005'
SMT1TMR22        EQU  H'0006'
SMT1TMR23        EQU  H'0007'


;----- SMT1CPRL Bits -----------------------------------------------------
SMT1CPR0         EQU  H'0000'
SMT1CPR1         EQU  H'0001'
SMT1CPR2         EQU  H'0002'
SMT1CPR3         EQU  H'0003'
SMT1CPR4         EQU  H'0004'
SMT1CPR5         EQU  H'0005'
SMT1CPR6         EQU  H'0006'
SMT1CPR7         EQU  H'0007'


;----- SMT1CPRH Bits -----------------------------------------------------
SMT1CPR8         EQU  H'0000'
SMT1CPR9         EQU  H'0001'
SMT1CPR10        EQU  H'0002'
SMT1CPR11        EQU  H'0003'
SMT1CPR12        EQU  H'0004'
SMT1CPR13        EQU  H'0005'
SMT1CPR14        EQU  H'0006'
SMT1CPR15        EQU  H'0007'


;----- SMT1CPRU Bits -----------------------------------------------------
SMT1CPR16        EQU  H'0000'
SMT1CPR17        EQU  H'0001'
SMT1CPR18        EQU  H'0002'
SMT1CPR19        EQU  H'0003'
SMT1CPR20        EQU  H'0004'
SMT1CPR21        EQU  H'0005'
SMT1CPR22        EQU  H'0006'
SMT1CPR23        EQU  H'0007'


